class Guidetext {
  List<Guidetopic> healthyGuide = [
    Guidetopic(
      "1. การออกกำลังกายเบาๆ แต่สม่ำเสมอ",
      [
        "ทำกิจกรรมทางกายที่หลากหลาย เช่น การเดิน การว่ายน้ำ และการปั่นจักรยาน",
        "ฝึกโยคะหรือพิลาทิสเพื่อรักษาความยืดหยุ่นของกล้ามเนื้อ",
      ],
    ),
    Guidetopic(
      "2. การรับประทานอาหารที่สมดุล",
      [
        "เลือกทานผักและผลไม้หลากหลายชนิดที่มีวิตามินและแร่ธาตุสูง",
        "เลือกทานผักและผลไม้หลากหลายชนิดที่มีวิตามินและแร่ธาตุสูง",
      ],
    ),
    Guidetopic(
      "3. การนอนหลับที่มีคุณภาพ",
      [
        "พักผ่อนอย่างน้อย 7-8 ชั่วโมงต่อคืนเพื่อให้สมองและร่างกายฟื้นฟู",
        "สร้างสภาพแวดล้อมที่เอื้อต่อการนอนหลับ เช่น การทำห้องนอนให้มืดและเงียบสงบ",
      ],
    ),
    Guidetopic(
      "4. การจัดการความเครียดอย่างเรียบง่าย",
      [
        "ใช้เทคนิคการผ่อนคลาย เช่น การฝึกหายใจลึกๆ การนั่งสมาธิ หรือการทำงานอดิเรกที่ชื่นชอบ",
        "หลีกเลี่ยงสถานการณ์ที่ทำให้เกิดความเครียด",
      ],
    ),
    Guidetopic(
      "5. การหลีกเลี่ยงสารเคมีที่เป็นอันตราย",
      [
        "หลีกเลี่ยงการสัมผัสยาฆ่าแมลงและสารเคมีที่เป็นอันตรายในชีวิตประจำวัน",
        "ใช้ผลิตภัณฑ์ธรรมชาติแทนสารเคมีในชีวิตประจำวัน",
      ],
    ),
  ];

  List<Guidetopic> mediumGuide = [
    Guidetopic(
      "1. การออกกำลังกายเบาๆ แต่สม่ำเสมอ",
      [
        "ทำกิจกรรมทางกายที่หลากหลาย เช่น การเดิน การว่ายน้ำ และการปั่นจักรยาน",
        "ฝึกโยคะหรือพิลาทิสเพื่อรักษาความยืดหยุ่นของกล้ามเนื้อ",
      ],
    ),
    Guidetopic(
      "2. การรับประทานอาหารที่มีคุณค่าทางโภชนาการสูง",
      [
        "เลือกทานอาหารที่มีประโยชน์และสมดุล เช่น ผัก ผลไม้ ธัญพืชเต็มเมล็ด ปลา และถั่ว",
        "ลดการบริโภคเนื้อสัตว์แดงและอาหารที่มีไขมันสูง",
        "ดื่มน้ำมากๆ เพื่อช่วยในการย่อยอาหารและลดการท้องผูก",
      ],
    ),
    Guidetopic(
      "3. การนอนหลับที่ดีและเพียงพอ",
      [
        "พักผ่อนอย่างน้อย 7-8 ชั่วโมงต่อคืนเพื่อให้สมองและร่างกายฟื้นฟู",
        "ปฏิบัติตามกิจวัตรการนอนหลับที่สม่ำเสมอ",
      ],
    ),
    Guidetopic(
      "4. การจัดการความเครียดอย่างมีประสิทธิภาพ",
      [
        "ใช้เทคนิคการผ่อนคลาย เช่น การฝึกหายใจลึกๆ การทำสมาธิ หรือการทำงานอดิเรกที่ชื่นชอบ",
        "เข้าร่วมกลุ่มสนับสนุนหรือการพูดคุยกับนักจิตวิทยาเพื่อจัดการกับความเครียด",
      ],
    ),
    Guidetopic(
      "5. การหลีกเลี่ยงสารเคมีที่เป็นอันตราย",
      [
        "หลีกเลี่ยงการสัมผัสยาฆ่าแมลงและสารเคมีที่เป็นอันตรายในชีวิตประจำวัน",
        "ใช้ผลิตภัณฑ์ธรรมชาติแทนสารเคมีในชีวิตประจำวัน",
      ],
    ),
  ];

  List<Guidetopic> severeGuide = [
    Guidetopic(
      "1. การออกกำลังกายที่เข้มข้น",
      [
        "ทำกิจกรรมแอโรบิค เช่น การเดินเร็ว วิ่ง หรือการปั่นจักรยาน",
        "ฝึกโยคะและพิลาทิสเพื่อเพิ่มความยืดหยุ่นของกล้ามเนื้อ",
        "การยกน้ำหนักเพื่อเสริมสร้างความแข็งแรงของกล้ามเนื้อ",
      ],
    ),
    Guidetopic(
      "2. การรับประทานอาหารที่มีคุณค่าทางโภชนาการสูง",
      [
        "เลือกทานอาหารที่มีประโยชน์และสมดุล เช่น ผัก ผลไม้ ธัญพืชเต็มเมล็ด ปลา และถั่ว",
        "ลดการบริโภคเนื้อสัตว์แดงและอาหารที่มีไขมันสูง",
        "ดื่มน้ำมากๆ เพื่อช่วยในการย่อยอาหารและลดการท้องผูก",
      ],
    ),
    Guidetopic(
      "3. การนอนหลับที่ดีและเพียงพอ",
      [
        "พักผ่อนอย่างน้อย 7-8 ชั่วโมงต่อคืนเพื่อให้สมองและร่างกายฟื้นฟู",
        "ปฏิบัติตามกิจวัตรการนอนหลับที่สม่ำเสมอ",
      ],
    ),
    Guidetopic(
      "4. การจัดการความเครียดอย่างมีประสิทธิภาพ",
      [
        "ใช้เทคนิคการผ่อนคลาย เช่น การฝึกหายใจลึกๆ การทำสมาธิ หรือการทำงานอดิเรกที่ชื่นชอบ",
        "เข้าร่วมกลุ่มสนับสนุนหรือการพูดคุยกับนักจิตวิทยาเพื่อจัดการกับความเครียด",
      ],
    ),
    Guidetopic(
      "5. การป้องกันการสัมผัสสารเคมีที่เป็นอันตราย",
      [
        "หลีกเลี่ยงการสัมผัสสารเคมีที่อาจเพิ่มความเสี่ยงต่อโรคพาร์กินสัน เช่น ยาฆ่าแมลง และสารพิษอื่นๆ",
        "ใช้ผลิตภัณฑ์ธรรมชาติแทนสารเคมีในชีวิตประจำวัน",
      ],
    ),
  ];
}

class Guidetopic {
  String topic;
  List<String> content;

  Guidetopic(this.topic, this.content);
}
