class FormQuestions {
  List<String> questions = [
    "คุณอายุมากกว่า60ปีหรือไม่?",
    "คุณเคยมีอาการสั่นหรือเกร็งที่มือ แขน หรือขา โดยเฉพาะขณะพักอยู่หรือไม่?",
    "คุณเคยรู้สึกถึงความเกร็งหรือแข็งของกล้ามเนื้อหรือไม่?",
    "คุณเขียนหนังสือช้าลงหรือเขียนตัวเล็กกว่าเดิมหรือไม่?",
    "คุณเคยมีการเคลื่อนไหวที่ช้าลงหรือไม่ เช่น อาบน้ำ แต่งตัว หรือเดินช้าลง?",
    "คุณรู้สึกว่าการทำกิจกรรมที่ต้องใช้มืออย่างละเอียดทำได้ลำบามากขึ้นหรือไม่?",
    "คุณหมุนตัวกลับเวลาเดินได้ลำบากหรือไม่?",
    "คุณลุกขึ้นจากเก้าอี้ได้ลำบากหรือไม่?",
    "คุณรู้สึกว่าพลิกตัวได้ลำบากเวลานอนหรือไม่?",
    "คุณมีปัญหากับการทรงตัวหรือการประสานงานหรือไม่?",
    "คุณมีอาการเหนื่อยหอบหรือมีปัญหาในการหายใจหรือไม่?",
    "คุณมีอาการเวียนศีรษะหรือไม่?",
    "คุณมีปัญหาในการรักษาสมดุลของร่างกายหรือไม่?",
    "คุณสังเกตเห็นการเปลี่ยนแปลงของลายมือ (เล็กลงหรือเขียนยากขึ้น) หรือไม่?",
    "คุณเคยมีปัญหากับการพูดหรือกลืนอาหารหรือไม่?",
    "คุณเคยโดนบอกว่าพูดช้าหรือพูดเสียงสั่นหรือไม่?",
    "คุณเคยมีปัญหาในการฟังหรือการมองเห็นหรือไม่?",
    "คุณเคยมีความรู้สึกเศร้าและไม่อยากทำอะไรหรือไม่?",
    "คุณมีอาการตกใจหรือหงุดหงิดง่ายหรือไม่?",
    "คุณมีปัญหาในการนอนหลับหรือมีอาการนอนไม่หลับหรือไม่?",
  ];
}
